{"C6L,D05,U11_30_5_en": {"timestamp": 1743257572.827807, "data": [{"link": "https://www.channelnewsasia.com/commentary/plane-crash-2025-america-aviation-accident-passenger-flying-safe-5022586", "source": "www.channelnewsasia.com", "title": "Commentary: How concerned should we be about the spate of aviation accidents in 2025?", "summary": "A string of high-profile plane crashes in early 2025 has spooked travellers. Aviation consultant Shukor Yusof weighs in on whether there are underlying issues in the industry.", "publishDate": "2025-03-26T06:00:00.000Z", "content": "SINGAPORE: Since the start of 2025, a string of high-profile plane crashes, particularly in North America, has spooked air travellers.\n\nFirst was the horrific mid-air collision between a US Air Force Blackhawk helicopter and an American Airlines Bombardier jet in Washington DC on Jan 29, which killed 67 people.\n\nNext was the crash of a Delta Air Lines aircraft, another Bombardier jet, which flipped over on landing at Toronto Pearson airport in Canada on Feb 17, with its right wing completely detached. Eighteen were injured.\n\nOn Mar 13, an American Airlines Boeing jet caught fire after landing in Denver. The plane was diverted from its intended destination of Dallas after crew members reported engine vibrations. Thankfully, everyone on board the aircraft evacuated safely.\n\nThere have been 94 aviation accidents in the United States in the first two months of 2025 – 63 in January and 31 in February – according to US government agency National Transportation Safety Board (NTSB), a government department responsible for air transport accidents.\n\nThese are undoubtedly high numbers, especially so early in the year, prompting many to question why. Are these accidents merely a statistical anomaly or are there underlying systemic issues?", "language": "en", "sentiment": "negative", "confidence": "0.9744901657104492", "stock_name": "Singapore Airlines"}, {"link": "https://www.reuters.com/markets/deals/dbs-leading-race-buy-controlling-stake-indonesias-panin-bank-sources-say-2025-03-26/", "source": "www.reuters.com", "title": "DBS leading race to buy controlling stake in Indonesia's Panin Bank, sources say", "summary": "DBS Group , Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank , three people with knowledge of the matter said.", "publishDate": "2025-03-26T05:26:11.462Z", "content": "DBS Group <a href=\"https://www.reuters.com/markets/companies/DBSM.SI\" target=\"_blank\">(DBSM.SI)</a>, Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank <a href=\"https://www.reuters.com/markets/companies/PNBN.JK\" target=\"_blank\">(PNBN.JK)</a>, three people with knowledge of the matter said.\nThe Singapore lender was competing with Malaysia's CIMB Group <a href=\"https://www.reuters.com/markets/companies/CIMB.KL\" target=\"_blank\">(CIMB.KL)</a> in the second round of the bidding process, according to one of the people.\nRoughly 86% of Panin Bank, Indonesia's 12th largest lender, is up for sale. As of Tuesday's market close, the combined holding owned by Australia's ANZ <a href=\"https://www.reuters.com/markets/companies/ANZ.AX\" target=\"_blank\">(ANZ.AX)</a> and the Gunawan family was worth $1.8 billion.\nANZ, which owns 39% according to LSEG data, has been trying to sell its stake since 2013. The founding Gunawan family is flexible about how much it might sell and the amount will depend on the offer price, sources <a href=\"/markets/deals/anz-gunawan-family-consider-selling-control-indonesias-panin-bank-sources-say-2024-10-03/\">have said</a>.\nBinding bids for the stake are due by end-April or early May subject to market conditions, according to two of the people, who added that the thinking of the bidders could change.\nThe sources declined to be identified as the matter was private.\nDBS, ANZ and CIMB declined to comment. Panin Bank's President Director Herwidayatmo referred Reuters' request for comment to its controlling shareholders.\nIf successful, DBS' acquisition of the Panin Bank stake would be first deal under incoming CEO <a href=\"/business/finance/who-is-tan-su-shan-singapore-bank-dbss-incoming-ceo-2024-08-08/\">Tan Su Shan</a>.\nTan, who will assume the role on March 28, <a href=\"/markets/deals/dbs-new-ceo-tan-eyes-bolt-on-acquisitions-bolster-tech-capabilities-2025-03-24/\">told Reuters</a> this week that DBS is open to bolt-on acquisitions if they fit strategically, created additional value and are earnings accretive within an acceptable period of time.\nAnalysts say the deal would propel DBS, which has a unit in Indonesia, to rank among the country's top 10 biggest banks.\nPT Bank DBS Indonesia has one head office and 33 other offices with 3,011 employees in 15 major cities, according to the DBS website.\nPanin Bank's businesses span consumer financing to private wealth. Singapore's Oversea-Chinese Banking Corp <a href=\"https://www.reuters.com/markets/companies/OCBC.SI\" target=\"_blank\">(OCBC.SI)</a> and Japan's Sumitomo Mitsui also showed interest in the sale earlier on, sources have <a href=\"/business/finance/indonesias-panin-bank-stake-sale-draws-southeast-asia-lenders-sources-say-2024-12-10/\">said</a>.\nPanin Bank, formally known as Bank Pan Indonesia, was founded by Mu'min Ali Gunawan in 1971 and listed on the Jakarta stock exchange in 1982.\nIts net profit climbed 8.2% to 2.74 trillion rupiah ($165 million) last year as interest income rose and it provisions for bad debt fell.\nThe bank's shares have plunged by about a fifth for the year to date, sliding along with other Indonesia stocks and the rupiah as investor <a href=\"/markets/asia/indonesia-takes-currency-stock-market-measures-after-rupiah-index-fall-2025-03-19/\">jitters</a> over government policy and the country's fiscal health grow.\n($1 = 16,590 rupiah)", "language": "en", "sentiment": "neutral", "confidence": "0.9998112320899963", "stock_name": "DBS Bank Singapore"}, {"link": "https://finance.yahoo.com/news/air-india-says-staff-travel-085944375.html", "source": "finance.yahoo.com", "title": "Air India says all staff to travel in Economy class from April", "summary": "", "publishDate": "2025-03-25T08:59:44.000Z", "content": "By Abhijith Ganapavaram\n\nNEW DELHI (Reuters) - Air India said on Tuesday that all staff, including top management, would travel in economy from April 1 to free up seats for paying customers, as the airline works on improving its image following criticism over flight delays.\n\nStaff would be upgraded to premium economy and business class seats on a flight only if these remained unsold 50 minutes prior to departure, The Times of India said in a report, confirmed by the airline.\n\n\"With this, we want to ensure that our premium seats... for which we are seeing huge demand - are available for booking to our customers first, demonstrating a culture of customer-centricity in the new Air India,\" a spokesperson said.\n\nIndia is among the world's fastest-growing major aviation markets, and its domestic air passenger traffic has been growing at an annual rate of 10-12% over the past 10 years, according to the government.\n\nThe formerly state-owned Air India was taken over by the Tata Group in 2022, and merged with Vistara - a joint venture between the Tatas and Singapore Airlines - last year.\n\nBillions of dollars have already been spent on an ambitious turnaround for the carrier, which involved ordering new jets, changing its logo, and upgrading interiors for over half its fleet, since the 2022 takeover.\n\nReuters reported last week that Air India was exploring a multi-billion dollar order for dozens of widebody jets from Boeing and Airbus.\n\n(Reporting by Abhijith Ganapavaram; Writing by Sakshi Dayal; Editing by Saad Sayeed)", "language": "en", "sentiment": "neutral", "confidence": "0.9999830722808838", "stock_name": "Singapore Airlines"}, {"link": "https://www.yahoo.com/news/plane-turns-around-pilot-forgets-203805596.html", "source": "www.yahoo.com", "title": "‘It’s quite embarrassing’: China-bound United flight turns around after pilot forgets passport", "summary": "", "publishDate": "2025-03-25T06:02:42.000Z", "content": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered one of the pilots had taken off without a passport, the airline told CNN in a statement.\n\nFlight UA 198 departed LAX at around 2 p.m. Saturday, March 22, with 257 passengers and 13 crew onboard and headed northwest over the Pacific Ocean, bound for China’s largest city.\n\nAbout two hours later, the plane turned around and was redirected to San Francisco, where it landed around 5 p.m. local time, according to the website FlightAware.\n\nAdvertisement Advertisement\n\nAdvertisement\n\n“The pilot did not have their passport onboard,” United said in the statement. “We arranged for a new crew to take our customers to their destination that evening. Customers were provided with meal vouchers and compensation.”\n\nThe flight with the new crew took off around 9 p.m. and landed in Shanghai about six hours behind schedule.\n\nYang Shuhan, a Chinese passenger on board, told CNN that she heard the pilot’s “very frustrated voice” over the intercom, saying he “forgot (his) passport.”\n\nAn inflight screen on United Airlines Flight 198, shot by Yang Shuhan, shows the plane diverting to SFO. - Yang Shuhan\n\nAfter landing in San Francisco, Yang received two meal vouchers totaling $30, which she used for a meal at a Japanese restaurant in the airport. She said she also filed a compensation claim on United’s website, where she was informed to expect a response within 14 business days.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nThe traveler from Hangzhou, in eastern China, was on her way back from a business trip. After reaching Shanghai at 12:43 a.m. on Monday, she still had to drive another two and a half hours, she said, leaving her exhausted.\n\nWhile the unexpected delay threw a wrench in her Monday working plans, Yang said she appreciated the pilot’s “honesty.” However, many of her fellow passengers grumbled and said they were “outraged” and “speechless” on RedNote, China’s Instagram-like platform.\n\n“How could someone mess up this badly at work?” read a popular RedNote post appearing to be from another Chinese passenger on board. The post has gotten more than 10,000 likes.\n\nThe disruptions didn’t stop with UA 198; passengers on the returning flight, UA 199 from Shanghai to Los Angeles, were also affected due to the late arrival of the inbound aircraft.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nA Shanghai-based business traveler, who requested to stay anonymous over privacy concerns, told CNN that their LA-bound flight was also delayed for about six hours, forcing them to change their ticket to catch a connecting flight.\n\n“I’m feeling pretty frustrated,” the person told CNN just after landing at LAX late Sunday night. “Because of the delay, I have to reschedule all my plans for Monday, which is really inconvenient.”\n\n‘Lack of discipline’\n\n“It’s quite embarrassing (for United),” Shukor Yusof, founder of Singapore-based Endau Analytics, an advisory firm that focuses on the aviation industry, told CNN.\n\nHe added that the mistake is “unacceptable” for a global airline like United and it shows “a lack of discipline.”\n\nAdvertisement Advertisement\n\nAdvertisement\n\nUnited is one of the world’s largest carriers, flying 140 million people to more than 300 destinations across six continents each year, according to the company’s website.\n\nShukor noted that the “absent-mindedness” reflected in the incident could cost the airline dearly, taking into account the costs of things like the jet fuel they had to dump before diverting and compensation for the passengers.\n\nWhile a series of plane crashes involving US carriers in recent months has raised security concerns, the latest incident with United is “more of a protocol issue,” said Shukor.\n\nJust last week, an Orthodox Jewish passenger filed a lawsuit against the airline, alleging a United pilot forcibly removed him from a lavatory while he was experiencing constipation, exposing his genitalia to others during a flight from Tulum, Mexico, to Houston.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nMeanwhile, a New Jersey mother blasted United for asking her to remove her “medically complex” son’s breathing tube ahead of the plane’s takeoff. Her TikTok video about the incident has garnered more than 1.3 million views.\n\nFor more CNN news and newsletters create an account at CNN.com", "language": "en", "sentiment": "neutral", "confidence": "0.9999446868896484", "stock_name": "Singapore Airlines"}, {"link": "https://www.reuters.com/markets/deals/dbs-new-ceo-tan-eyes-bolt-on-acquisitions-bolster-tech-capabilities-2025-03-24/", "source": "www.reuters.com", "title": "DBS' new CEO Tan eyes 'bolt-on' acquisitions to bolster tech capabilities", "summary": "DBS Group's incoming CEO Tan Su Shan is eyeing \"bolt-on\" acquisitions that align with the Singaporean lender's digital and AI-driven priorities, while focusing on boosting high-return businesses such as wealth and transaction banking.", "publishDate": "2025-03-24T09:53:51.063Z", "content": "DBS Group's <a href=\"https://www.reuters.com/markets/companies/DBSM.SI\" target=\"_blank\">(DBSM.SI)</a> incoming CEO <a href=\"/business/finance/who-is-tan-su-shan-singapore-bank-dbss-incoming-ceo-2024-08-08/\">Tan Su Shan</a> is eyeing \"bolt-on\" acquisitions that align with the Singaporean lender's digital and AI-driven priorities, while focusing on boosting high-return businesses such as wealth and transaction banking.\nTan, 57 and currently deputy CEO, will become DBS' first female CEO and also the first to be <a href=\"/business/finance/singapores-dbs-says-insider-tan-su-shan-succeed-piyush-gupta-ceo-2024-08-07/\">appointed</a> from within the ranks of the bank on March 28. She will replace Piyush Gupta, 65, who has led the Southeast Asia's No.1 lender for 15 years.\nA Singaporean and an Oxford University graduate, Tan will take up the top job against the backdrop of the bank <a href=\"/business/finance/singapore-bank-dbs-fourth-quarter-net-profit-rises-10-year-2025-02-09/\">posting record</a> annual revenue and profits, although in the near-term she will have to deal with global economic and markets volatility.\n\"We recognise that there will be significant uncertainty in the macroeconomic environment and geopolitical landscape, driven by ongoing military conflicts, the risk of escalating tariffs, and potential shifts in policy,\" she said.\n\"We do scenario planning regularly, and have in place targeted early warning triggers, along with action plans,\" Tan, who has been with the bank for 15 years, told Reuters in response to questions emailed to the bank.\nBesides its presence in Asian financial hubs Singapore and Hong Kong, DBS' main markets in the region include India, China, Taiwan and Indonesia. It competes with global banks such as HSBC <a href=\"https://www.reuters.com/markets/companies/HSBA.L\" target=\"_blank\">(HSBA.L)</a> and Standard Chartered <a href=\"https://www.reuters.com/markets/companies/STAN.L\" target=\"_blank\">(STAN.L)</a> in those markets.\nTan said that DBS would like to stay focused on its existing operational footprint and not spread itself \"too thin\".\n\"We are only interested in bolt-on deals rather than large-scale M&As which will divert attention from our areas of focus,\" she said, adding the focus of plug-in acquisitions would be on digital technologies and artificial intelligence (AI).\nDBS has identified about 13,000 staff for upskilling or reskilling, including for AI and data-related skills, with around 10,000 having already begun training, to ensure employees are future-ready, she added.\nThe bank has also created a new role of Chief Operating Officer, to be assumed by current group audit head Derrick Goh and will be effective from April 1, will oversee both the bank's operations and transformation.\n\"One of Su Shan's key strengths is her ability to build and empower teams, identifying areas for improvement and developing people and culture so that the team can perform at full potential,\" Gupta said about his successor in response to questions emailed to the bank.\n\"She is also a hands-on leader, customer-centric and well connected, and should play off these strengths.\"", "language": "en", "sentiment": "positive", "confidence": "0.999992847442627", "stock_name": "DBS Bank Singapore"}]}, "9CI,C52,C6L,CC3,D05,O39,S63,U11,U96,Z74_30_5_en": {"timestamp": 1743257725.78293, "data": [{"link": "https://www.channelnewsasia.com/commentary/plane-crash-2025-america-aviation-accident-passenger-flying-safe-5022586", "source": "www.channelnewsasia.com", "title": "Commentary: How concerned should we be about the spate of aviation accidents in 2025?", "summary": "A string of high-profile plane crashes in early 2025 has spooked travellers. Aviation consultant Shukor Yusof weighs in on whether there are underlying issues in the industry.", "publishDate": "2025-03-26T06:00:00.000Z", "content": "SINGAPORE: Since the start of 2025, a string of high-profile plane crashes, particularly in North America, has spooked air travellers.\n\nFirst was the horrific mid-air collision between a US Air Force Blackhawk helicopter and an American Airlines Bombardier jet in Washington DC on Jan 29, which killed 67 people.\n\nNext was the crash of a Delta Air Lines aircraft, another Bombardier jet, which flipped over on landing at Toronto Pearson airport in Canada on Feb 17, with its right wing completely detached. Eighteen were injured.\n\nOn Mar 13, an American Airlines Boeing jet caught fire after landing in Denver. The plane was diverted from its intended destination of Dallas after crew members reported engine vibrations. Thankfully, everyone on board the aircraft evacuated safely.\n\nThere have been 94 aviation accidents in the United States in the first two months of 2025 – 63 in January and 31 in February – according to US government agency National Transportation Safety Board (NTSB), a government department responsible for air transport accidents.\n\nThese are undoubtedly high numbers, especially so early in the year, prompting many to question why. Are these accidents merely a statistical anomaly or are there underlying systemic issues?", "language": "en", "sentiment": "negative", "confidence": "0.9744901657104492", "stock_name": "Singapore Airlines"}, {"link": "https://www.reuters.com/markets/deals/dbs-leading-race-buy-controlling-stake-indonesias-panin-bank-sources-say-2025-03-26/", "source": "www.reuters.com", "title": "DBS leading race to buy controlling stake in Indonesia's Panin Bank, sources say", "summary": "DBS Group , Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank , three people with knowledge of the matter said.", "publishDate": "2025-03-26T05:26:11.462Z", "content": "DBS Group <a href=\"https://www.reuters.com/markets/companies/DBSM.SI\" target=\"_blank\">(DBSM.SI)</a>, Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank <a href=\"https://www.reuters.com/markets/companies/PNBN.JK\" target=\"_blank\">(PNBN.JK)</a>, three people with knowledge of the matter said.\nThe Singapore lender was competing with Malaysia's CIMB Group <a href=\"https://www.reuters.com/markets/companies/CIMB.KL\" target=\"_blank\">(CIMB.KL)</a> in the second round of the bidding process, according to one of the people.\nRoughly 86% of Panin Bank, Indonesia's 12th largest lender, is up for sale. As of Tuesday's market close, the combined holding owned by Australia's ANZ <a href=\"https://www.reuters.com/markets/companies/ANZ.AX\" target=\"_blank\">(ANZ.AX)</a> and the Gunawan family was worth $1.8 billion.\nANZ, which owns 39% according to LSEG data, has been trying to sell its stake since 2013. The founding Gunawan family is flexible about how much it might sell and the amount will depend on the offer price, sources <a href=\"/markets/deals/anz-gunawan-family-consider-selling-control-indonesias-panin-bank-sources-say-2024-10-03/\">have said</a>.\nBinding bids for the stake are due by end-April or early May subject to market conditions, according to two of the people, who added that the thinking of the bidders could change.\nThe sources declined to be identified as the matter was private.\nDBS, ANZ and CIMB declined to comment. Panin Bank's President Director Herwidayatmo referred Reuters' request for comment to its controlling shareholders.\nIf successful, DBS' acquisition of the Panin Bank stake would be first deal under incoming CEO <a href=\"/business/finance/who-is-tan-su-shan-singapore-bank-dbss-incoming-ceo-2024-08-08/\">Tan Su Shan</a>.\nTan, who will assume the role on March 28, <a href=\"/markets/deals/dbs-new-ceo-tan-eyes-bolt-on-acquisitions-bolster-tech-capabilities-2025-03-24/\">told Reuters</a> this week that DBS is open to bolt-on acquisitions if they fit strategically, created additional value and are earnings accretive within an acceptable period of time.\nAnalysts say the deal would propel DBS, which has a unit in Indonesia, to rank among the country's top 10 biggest banks.\nPT Bank DBS Indonesia has one head office and 33 other offices with 3,011 employees in 15 major cities, according to the DBS website.\nPanin Bank's businesses span consumer financing to private wealth. Singapore's Oversea-Chinese Banking Corp <a href=\"https://www.reuters.com/markets/companies/OCBC.SI\" target=\"_blank\">(OCBC.SI)</a> and Japan's Sumitomo Mitsui also showed interest in the sale earlier on, sources have <a href=\"/business/finance/indonesias-panin-bank-stake-sale-draws-southeast-asia-lenders-sources-say-2024-12-10/\">said</a>.\nPanin Bank, formally known as Bank Pan Indonesia, was founded by Mu'min Ali Gunawan in 1971 and listed on the Jakarta stock exchange in 1982.\nIts net profit climbed 8.2% to 2.74 trillion rupiah ($165 million) last year as interest income rose and it provisions for bad debt fell.\nThe bank's shares have plunged by about a fifth for the year to date, sliding along with other Indonesia stocks and the rupiah as investor <a href=\"/markets/asia/indonesia-takes-currency-stock-market-measures-after-rupiah-index-fall-2025-03-19/\">jitters</a> over government policy and the country's fiscal health grow.\n($1 = 16,590 rupiah)", "language": "en", "sentiment": "neutral", "confidence": "0.9998112320899963", "stock_name": "DBS Bank Singapore"}, {"link": "https://www.reuters.com/markets/deals/thailands-intouch-shareholders-approve-energy-telecom-merger-with-gulf-energy-2025-03-25/", "source": "www.reuters.com", "title": "Shareholders of Thailand's Intouch approve merger with Gulf Energy", "summary": "Shareholders of Thailand-based telecoms operator Intouch Holdings gave their backing on Tuesday to a planned $25 billion merger with billionaire Sarath Ratanavadi's Gulf Energy , although the deal is still complicated by the need for affiliate companies' approval.", "publishDate": "2025-03-25T13:18:09.357Z", "content": "Shareholders of Thailand-based telecoms operator Intouch Holdings <a href=\"https://www.reuters.com/markets/companies/INTUCH.BK\" target=\"_blank\">(INTUCH.BK)</a> gave their backing on Tuesday to a planned $25 billion merger with billionaire Sarath Ratanavadi's Gulf Energy <a href=\"https://www.reuters.com/markets/companies/GULFI.BK\" target=\"_blank\">(GULFI.BK)</a>, although the deal is still complicated by the need for affiliate companies' approval.\nGulf and Intouch announced last July that they planned to merge to combine their energy and telecom assets and improve operations and investments.\nPower producer Gulf Energy owns about a 47.4% stake in Intouch and Gulf's shareholders approved the merger last October.\nA filing by Intouch on Tuesday showed that more than 99% of its shareholders had voted in favour of approving the registered capital of the newly formed entity, which would be called Gulf Development.\nHowever, completion of the merger could still be complicated if the shareholders of affiliate companies Thaicom, a Thai mobile carrier controlled by Gulf Energy, and Advanced Info <a href=\"https://www.reuters.com/markets/companies/ADVANC.BK\" target=\"_blank\">(ADVANC.BK)</a>, another Thai mobile carrier controlled by Intouch, reject plans to be acquired as part of the merger deal.\nGulf Energy, Intouch and Sarath had offered to buy 58.9% of Thaicom at 11 baht apiece.\nIn January, Thaicom asked its shareholders to vote against the deal, saying its stock price had risen since the merger announcement.\nAdvanced Info's board had <a href=\"/business/media-telecom/thai-telcos-advanced-info-thaicom-want-investors-reject-offers-acquire-them-2025-01-16/\">also</a> advised its shareholders to reject being acquired as part of the merger deal.\nGulf Energy is currently valued at $17.25 billion, while Intouch has a market capitalisation of $7.72 billion, according to data compiled by LSEG.\nSarath, who is CEO of Gulf Energy, has a net worth of $12.9 billion according to <a href=\"https://www.forbes.com/profile/sarath-ratanavadi/\" target=\"_blank\">Forbes</a> and is Thailand's fifth richest person.\nIntouch's second biggest shareholder is Singapore Telecommunication <a href=\"https://www.reuters.com/markets/companies/STEL.SI\" target=\"_blank\">(STEL.SI)</a> (Singtel) which has an interest of around 25%.\nAdvanced, Thaicom and Singtel did not immediately respond to Reuters requests for comment.\n($1 = 33.7500 baht)", "language": "en", "sentiment": "neutral", "confidence": "0.9998857975006104", "stock_name": "Singtel Singapore"}, {"link": "https://finance.yahoo.com/news/air-india-says-staff-travel-085944375.html", "source": "finance.yahoo.com", "title": "Air India says all staff to travel in Economy class from April", "summary": "", "publishDate": "2025-03-25T08:59:44.000Z", "content": "By Abhijith Ganapavaram\n\nNEW DELHI (Reuters) - Air India said on Tuesday that all staff, including top management, would travel in economy from April 1 to free up seats for paying customers, as the airline works on improving its image following criticism over flight delays.\n\nStaff would be upgraded to premium economy and business class seats on a flight only if these remained unsold 50 minutes prior to departure, The Times of India said in a report, confirmed by the airline.\n\n\"With this, we want to ensure that our premium seats... for which we are seeing huge demand - are available for booking to our customers first, demonstrating a culture of customer-centricity in the new Air India,\" a spokesperson said.\n\nIndia is among the world's fastest-growing major aviation markets, and its domestic air passenger traffic has been growing at an annual rate of 10-12% over the past 10 years, according to the government.\n\nThe formerly state-owned Air India was taken over by the Tata Group in 2022, and merged with Vistara - a joint venture between the Tatas and Singapore Airlines - last year.\n\nBillions of dollars have already been spent on an ambitious turnaround for the carrier, which involved ordering new jets, changing its logo, and upgrading interiors for over half its fleet, since the 2022 takeover.\n\nReuters reported last week that Air India was exploring a multi-billion dollar order for dozens of widebody jets from Boeing and Airbus.\n\n(Reporting by Abhijith Ganapavaram; Writing by Sakshi Dayal; Editing by Saad Sayeed)", "language": "en", "sentiment": "neutral", "confidence": "0.9999830722808838", "stock_name": "Singapore Airlines"}, {"link": "https://www.yahoo.com/news/plane-turns-around-pilot-forgets-203805596.html", "source": "www.yahoo.com", "title": "‘It’s quite embarrassing’: China-bound United flight turns around after pilot forgets passport", "summary": "", "publishDate": "2025-03-25T06:02:42.000Z", "content": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered one of the pilots had taken off without a passport, the airline told CNN in a statement.\n\nFlight UA 198 departed LAX at around 2 p.m. Saturday, March 22, with 257 passengers and 13 crew onboard and headed northwest over the Pacific Ocean, bound for China’s largest city.\n\nAbout two hours later, the plane turned around and was redirected to San Francisco, where it landed around 5 p.m. local time, according to the website FlightAware.\n\nAdvertisement Advertisement\n\nAdvertisement\n\n“The pilot did not have their passport onboard,” United said in the statement. “We arranged for a new crew to take our customers to their destination that evening. Customers were provided with meal vouchers and compensation.”\n\nThe flight with the new crew took off around 9 p.m. and landed in Shanghai about six hours behind schedule.\n\nYang Shuhan, a Chinese passenger on board, told CNN that she heard the pilot’s “very frustrated voice” over the intercom, saying he “forgot (his) passport.”\n\nAn inflight screen on United Airlines Flight 198, shot by Yang Shuhan, shows the plane diverting to SFO. - Yang Shuhan\n\nAfter landing in San Francisco, Yang received two meal vouchers totaling $30, which she used for a meal at a Japanese restaurant in the airport. She said she also filed a compensation claim on United’s website, where she was informed to expect a response within 14 business days.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nThe traveler from Hangzhou, in eastern China, was on her way back from a business trip. After reaching Shanghai at 12:43 a.m. on Monday, she still had to drive another two and a half hours, she said, leaving her exhausted.\n\nWhile the unexpected delay threw a wrench in her Monday working plans, Yang said she appreciated the pilot’s “honesty.” However, many of her fellow passengers grumbled and said they were “outraged” and “speechless” on RedNote, China’s Instagram-like platform.\n\n“How could someone mess up this badly at work?” read a popular RedNote post appearing to be from another Chinese passenger on board. The post has gotten more than 10,000 likes.\n\nThe disruptions didn’t stop with UA 198; passengers on the returning flight, UA 199 from Shanghai to Los Angeles, were also affected due to the late arrival of the inbound aircraft.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nA Shanghai-based business traveler, who requested to stay anonymous over privacy concerns, told CNN that their LA-bound flight was also delayed for about six hours, forcing them to change their ticket to catch a connecting flight.\n\n“I’m feeling pretty frustrated,” the person told CNN just after landing at LAX late Sunday night. “Because of the delay, I have to reschedule all my plans for Monday, which is really inconvenient.”\n\n‘Lack of discipline’\n\n“It’s quite embarrassing (for United),” Shukor Yusof, founder of Singapore-based Endau Analytics, an advisory firm that focuses on the aviation industry, told CNN.\n\nHe added that the mistake is “unacceptable” for a global airline like United and it shows “a lack of discipline.”\n\nAdvertisement Advertisement\n\nAdvertisement\n\nUnited is one of the world’s largest carriers, flying 140 million people to more than 300 destinations across six continents each year, according to the company’s website.\n\nShukor noted that the “absent-mindedness” reflected in the incident could cost the airline dearly, taking into account the costs of things like the jet fuel they had to dump before diverting and compensation for the passengers.\n\nWhile a series of plane crashes involving US carriers in recent months has raised security concerns, the latest incident with United is “more of a protocol issue,” said Shukor.\n\nJust last week, an Orthodox Jewish passenger filed a lawsuit against the airline, alleging a United pilot forcibly removed him from a lavatory while he was experiencing constipation, exposing his genitalia to others during a flight from Tulum, Mexico, to Houston.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nMeanwhile, a New Jersey mother blasted United for asking her to remove her “medically complex” son’s breathing tube ahead of the plane’s takeoff. Her TikTok video about the incident has garnered more than 1.3 million views.\n\nFor more CNN news and newsletters create an account at CNN.com", "language": "en", "sentiment": "neutral", "confidence": "0.9999446868896484", "stock_name": "Singapore Airlines"}]}, "C6L,D05,Z74_30_5_en": {"timestamp": 1743257803.855167, "data": [{"link": "https://www.channelnewsasia.com/commentary/plane-crash-2025-america-aviation-accident-passenger-flying-safe-5022586", "source": "www.channelnewsasia.com", "title": "Commentary: How concerned should we be about the spate of aviation accidents in 2025?", "summary": "A string of high-profile plane crashes in early 2025 has spooked travellers. Aviation consultant Shukor Yusof weighs in on whether there are underlying issues in the industry.", "publishDate": "2025-03-26T06:00:00.000Z", "content": "SINGAPORE: Since the start of 2025, a string of high-profile plane crashes, particularly in North America, has spooked air travellers.\n\nFirst was the horrific mid-air collision between a US Air Force Blackhawk helicopter and an American Airlines Bombardier jet in Washington DC on Jan 29, which killed 67 people.\n\nNext was the crash of a Delta Air Lines aircraft, another Bombardier jet, which flipped over on landing at Toronto Pearson airport in Canada on Feb 17, with its right wing completely detached. Eighteen were injured.\n\nOn Mar 13, an American Airlines Boeing jet caught fire after landing in Denver. The plane was diverted from its intended destination of Dallas after crew members reported engine vibrations. Thankfully, everyone on board the aircraft evacuated safely.\n\nThere have been 94 aviation accidents in the United States in the first two months of 2025 – 63 in January and 31 in February – according to US government agency National Transportation Safety Board (NTSB), a government department responsible for air transport accidents.\n\nThese are undoubtedly high numbers, especially so early in the year, prompting many to question why. Are these accidents merely a statistical anomaly or are there underlying systemic issues?", "language": "en", "sentiment": "negative", "confidence": "0.9744901657104492", "stock_name": "Singapore Airlines"}, {"link": "https://www.reuters.com/markets/deals/dbs-leading-race-buy-controlling-stake-indonesias-panin-bank-sources-say-2025-03-26/", "source": "www.reuters.com", "title": "DBS leading race to buy controlling stake in Indonesia's Panin Bank, sources say", "summary": "DBS Group , Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank , three people with knowledge of the matter said.", "publishDate": "2025-03-26T05:26:11.462Z", "content": "DBS Group <a href=\"https://www.reuters.com/markets/companies/DBSM.SI\" target=\"_blank\">(DBSM.SI)</a>, Southeast Asia's top bank by assets, is the frontrunner to buy a controlling stake in Indonesia's Panin Bank <a href=\"https://www.reuters.com/markets/companies/PNBN.JK\" target=\"_blank\">(PNBN.JK)</a>, three people with knowledge of the matter said.\nThe Singapore lender was competing with Malaysia's CIMB Group <a href=\"https://www.reuters.com/markets/companies/CIMB.KL\" target=\"_blank\">(CIMB.KL)</a> in the second round of the bidding process, according to one of the people.\nRoughly 86% of Panin Bank, Indonesia's 12th largest lender, is up for sale. As of Tuesday's market close, the combined holding owned by Australia's ANZ <a href=\"https://www.reuters.com/markets/companies/ANZ.AX\" target=\"_blank\">(ANZ.AX)</a> and the Gunawan family was worth $1.8 billion.\nANZ, which owns 39% according to LSEG data, has been trying to sell its stake since 2013. The founding Gunawan family is flexible about how much it might sell and the amount will depend on the offer price, sources <a href=\"/markets/deals/anz-gunawan-family-consider-selling-control-indonesias-panin-bank-sources-say-2024-10-03/\">have said</a>.\nBinding bids for the stake are due by end-April or early May subject to market conditions, according to two of the people, who added that the thinking of the bidders could change.\nThe sources declined to be identified as the matter was private.\nDBS, ANZ and CIMB declined to comment. Panin Bank's President Director Herwidayatmo referred Reuters' request for comment to its controlling shareholders.\nIf successful, DBS' acquisition of the Panin Bank stake would be first deal under incoming CEO <a href=\"/business/finance/who-is-tan-su-shan-singapore-bank-dbss-incoming-ceo-2024-08-08/\">Tan Su Shan</a>.\nTan, who will assume the role on March 28, <a href=\"/markets/deals/dbs-new-ceo-tan-eyes-bolt-on-acquisitions-bolster-tech-capabilities-2025-03-24/\">told Reuters</a> this week that DBS is open to bolt-on acquisitions if they fit strategically, created additional value and are earnings accretive within an acceptable period of time.\nAnalysts say the deal would propel DBS, which has a unit in Indonesia, to rank among the country's top 10 biggest banks.\nPT Bank DBS Indonesia has one head office and 33 other offices with 3,011 employees in 15 major cities, according to the DBS website.\nPanin Bank's businesses span consumer financing to private wealth. Singapore's Oversea-Chinese Banking Corp <a href=\"https://www.reuters.com/markets/companies/OCBC.SI\" target=\"_blank\">(OCBC.SI)</a> and Japan's Sumitomo Mitsui also showed interest in the sale earlier on, sources have <a href=\"/business/finance/indonesias-panin-bank-stake-sale-draws-southeast-asia-lenders-sources-say-2024-12-10/\">said</a>.\nPanin Bank, formally known as Bank Pan Indonesia, was founded by Mu'min Ali Gunawan in 1971 and listed on the Jakarta stock exchange in 1982.\nIts net profit climbed 8.2% to 2.74 trillion rupiah ($165 million) last year as interest income rose and it provisions for bad debt fell.\nThe bank's shares have plunged by about a fifth for the year to date, sliding along with other Indonesia stocks and the rupiah as investor <a href=\"/markets/asia/indonesia-takes-currency-stock-market-measures-after-rupiah-index-fall-2025-03-19/\">jitters</a> over government policy and the country's fiscal health grow.\n($1 = 16,590 rupiah)", "language": "en", "sentiment": "neutral", "confidence": "0.9998112320899963", "stock_name": "DBS Bank Singapore"}, {"link": "https://www.reuters.com/markets/deals/thailands-intouch-shareholders-approve-energy-telecom-merger-with-gulf-energy-2025-03-25/", "source": "www.reuters.com", "title": "Shareholders of Thailand's Intouch approve merger with Gulf Energy", "summary": "Shareholders of Thailand-based telecoms operator Intouch Holdings gave their backing on Tuesday to a planned $25 billion merger with billionaire Sarath Ratanavadi's Gulf Energy , although the deal is still complicated by the need for affiliate companies' approval.", "publishDate": "2025-03-25T13:18:09.357Z", "content": "Shareholders of Thailand-based telecoms operator Intouch Holdings <a href=\"https://www.reuters.com/markets/companies/INTUCH.BK\" target=\"_blank\">(INTUCH.BK)</a> gave their backing on Tuesday to a planned $25 billion merger with billionaire Sarath Ratanavadi's Gulf Energy <a href=\"https://www.reuters.com/markets/companies/GULFI.BK\" target=\"_blank\">(GULFI.BK)</a>, although the deal is still complicated by the need for affiliate companies' approval.\nGulf and Intouch announced last July that they planned to merge to combine their energy and telecom assets and improve operations and investments.\nPower producer Gulf Energy owns about a 47.4% stake in Intouch and Gulf's shareholders approved the merger last October.\nA filing by Intouch on Tuesday showed that more than 99% of its shareholders had voted in favour of approving the registered capital of the newly formed entity, which would be called Gulf Development.\nHowever, completion of the merger could still be complicated if the shareholders of affiliate companies Thaicom, a Thai mobile carrier controlled by Gulf Energy, and Advanced Info <a href=\"https://www.reuters.com/markets/companies/ADVANC.BK\" target=\"_blank\">(ADVANC.BK)</a>, another Thai mobile carrier controlled by Intouch, reject plans to be acquired as part of the merger deal.\nGulf Energy, Intouch and Sarath had offered to buy 58.9% of Thaicom at 11 baht apiece.\nIn January, Thaicom asked its shareholders to vote against the deal, saying its stock price had risen since the merger announcement.\nAdvanced Info's board had <a href=\"/business/media-telecom/thai-telcos-advanced-info-thaicom-want-investors-reject-offers-acquire-them-2025-01-16/\">also</a> advised its shareholders to reject being acquired as part of the merger deal.\nGulf Energy is currently valued at $17.25 billion, while Intouch has a market capitalisation of $7.72 billion, according to data compiled by LSEG.\nSarath, who is CEO of Gulf Energy, has a net worth of $12.9 billion according to <a href=\"https://www.forbes.com/profile/sarath-ratanavadi/\" target=\"_blank\">Forbes</a> and is Thailand's fifth richest person.\nIntouch's second biggest shareholder is Singapore Telecommunication <a href=\"https://www.reuters.com/markets/companies/STEL.SI\" target=\"_blank\">(STEL.SI)</a> (Singtel) which has an interest of around 25%.\nAdvanced, Thaicom and Singtel did not immediately respond to Reuters requests for comment.\n($1 = 33.7500 baht)", "language": "en", "sentiment": "neutral", "confidence": "0.9998857975006104", "stock_name": "Singtel Singapore"}, {"link": "https://finance.yahoo.com/news/air-india-says-staff-travel-085944375.html", "source": "finance.yahoo.com", "title": "Air India says all staff to travel in Economy class from April", "summary": "", "publishDate": "2025-03-25T08:59:44.000Z", "content": "By Abhijith Ganapavaram\n\nNEW DELHI (Reuters) - Air India said on Tuesday that all staff, including top management, would travel in economy from April 1 to free up seats for paying customers, as the airline works on improving its image following criticism over flight delays.\n\nStaff would be upgraded to premium economy and business class seats on a flight only if these remained unsold 50 minutes prior to departure, The Times of India said in a report, confirmed by the airline.\n\n\"With this, we want to ensure that our premium seats... for which we are seeing huge demand - are available for booking to our customers first, demonstrating a culture of customer-centricity in the new Air India,\" a spokesperson said.\n\nIndia is among the world's fastest-growing major aviation markets, and its domestic air passenger traffic has been growing at an annual rate of 10-12% over the past 10 years, according to the government.\n\nThe formerly state-owned Air India was taken over by the Tata Group in 2022, and merged with Vistara - a joint venture between the Tatas and Singapore Airlines - last year.\n\nBillions of dollars have already been spent on an ambitious turnaround for the carrier, which involved ordering new jets, changing its logo, and upgrading interiors for over half its fleet, since the 2022 takeover.\n\nReuters reported last week that Air India was exploring a multi-billion dollar order for dozens of widebody jets from Boeing and Airbus.\n\n(Reporting by Abhijith Ganapavaram; Writing by Sakshi Dayal; Editing by Saad Sayeed)", "language": "en", "sentiment": "neutral", "confidence": "0.9999830722808838", "stock_name": "Singapore Airlines"}, {"link": "https://www.yahoo.com/news/plane-turns-around-pilot-forgets-203805596.html", "source": "www.yahoo.com", "title": "‘It’s quite embarrassing’: China-bound United flight turns around after pilot forgets passport", "summary": "", "publishDate": "2025-03-25T06:02:42.000Z", "content": "A United Airlines Boeing 787 jetliner flying from Los Angeles to Shanghai had to turn around last weekend after it was discovered one of the pilots had taken off without a passport, the airline told CNN in a statement.\n\nFlight UA 198 departed LAX at around 2 p.m. Saturday, March 22, with 257 passengers and 13 crew onboard and headed northwest over the Pacific Ocean, bound for China’s largest city.\n\nAbout two hours later, the plane turned around and was redirected to San Francisco, where it landed around 5 p.m. local time, according to the website FlightAware.\n\nAdvertisement Advertisement\n\nAdvertisement\n\n“The pilot did not have their passport onboard,” United said in the statement. “We arranged for a new crew to take our customers to their destination that evening. Customers were provided with meal vouchers and compensation.”\n\nThe flight with the new crew took off around 9 p.m. and landed in Shanghai about six hours behind schedule.\n\nYang Shuhan, a Chinese passenger on board, told CNN that she heard the pilot’s “very frustrated voice” over the intercom, saying he “forgot (his) passport.”\n\nAn inflight screen on United Airlines Flight 198, shot by Yang Shuhan, shows the plane diverting to SFO. - Yang Shuhan\n\nAfter landing in San Francisco, Yang received two meal vouchers totaling $30, which she used for a meal at a Japanese restaurant in the airport. She said she also filed a compensation claim on United’s website, where she was informed to expect a response within 14 business days.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nThe traveler from Hangzhou, in eastern China, was on her way back from a business trip. After reaching Shanghai at 12:43 a.m. on Monday, she still had to drive another two and a half hours, she said, leaving her exhausted.\n\nWhile the unexpected delay threw a wrench in her Monday working plans, Yang said she appreciated the pilot’s “honesty.” However, many of her fellow passengers grumbled and said they were “outraged” and “speechless” on RedNote, China’s Instagram-like platform.\n\n“How could someone mess up this badly at work?” read a popular RedNote post appearing to be from another Chinese passenger on board. The post has gotten more than 10,000 likes.\n\nThe disruptions didn’t stop with UA 198; passengers on the returning flight, UA 199 from Shanghai to Los Angeles, were also affected due to the late arrival of the inbound aircraft.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nA Shanghai-based business traveler, who requested to stay anonymous over privacy concerns, told CNN that their LA-bound flight was also delayed for about six hours, forcing them to change their ticket to catch a connecting flight.\n\n“I’m feeling pretty frustrated,” the person told CNN just after landing at LAX late Sunday night. “Because of the delay, I have to reschedule all my plans for Monday, which is really inconvenient.”\n\n‘Lack of discipline’\n\n“It’s quite embarrassing (for United),” Shukor Yusof, founder of Singapore-based Endau Analytics, an advisory firm that focuses on the aviation industry, told CNN.\n\nHe added that the mistake is “unacceptable” for a global airline like United and it shows “a lack of discipline.”\n\nAdvertisement Advertisement\n\nAdvertisement\n\nUnited is one of the world’s largest carriers, flying 140 million people to more than 300 destinations across six continents each year, according to the company’s website.\n\nShukor noted that the “absent-mindedness” reflected in the incident could cost the airline dearly, taking into account the costs of things like the jet fuel they had to dump before diverting and compensation for the passengers.\n\nWhile a series of plane crashes involving US carriers in recent months has raised security concerns, the latest incident with United is “more of a protocol issue,” said Shukor.\n\nJust last week, an Orthodox Jewish passenger filed a lawsuit against the airline, alleging a United pilot forcibly removed him from a lavatory while he was experiencing constipation, exposing his genitalia to others during a flight from Tulum, Mexico, to Houston.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nMeanwhile, a New Jersey mother blasted United for asking her to remove her “medically complex” son’s breathing tube ahead of the plane’s takeoff. Her TikTok video about the incident has garnered more than 1.3 million views.\n\nFor more CNN news and newsletters create an account at CNN.com", "language": "en", "sentiment": "neutral", "confidence": "0.9999446868896484", "stock_name": "Singapore Airlines"}]}, "AAPL,C6L.SI,MSFT_30_5_en": {"timestamp": 1743314039.094571, "data": [{"link": "https://finance.yahoo.com/news/microsoft-msft-best-gaming-stock-222527914.html", "source": "finance.yahoo.com", "title": "Microsoft (MSFT): The Best Gaming Stock to Invest In According to Billionaires", "summary": "", "publishDate": "2025-03-29T22:25:27.000Z", "content": "We recently compiled a list of the 10 Best Gaming Stocks to Invest In According to Billionaires. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against the other gaming stocks.\n\nThe gaming industry has experienced significant changes over the past few years. During the COVID-19 pandemic, the sector saw remarkable growth as more people spent time indoors. However, this momentum did not continue after restrictions eased, which led to lower consumer spending on games and consoles. Economic uncertainties and challenges like inflation further impacted the industry, resulting in layoffs, studio closures, and project cancellations across the industry in 2024. Despite these setbacks, analysts are optimistic about a recovery supported by upcoming major releases.\n\nREAD ALSO: 8 Fastest Growing AI Stocks To Buy Right Now and 20 Best Fintech Stocks to Buy According to Billionaires.\n\nAccording to research firm Newzoo, video game consoles are expected to be the biggest growth driver in the market until 2027. The anticipated launches of GTA VI in fall 2025 and the new Switch console in summer 2025 are seen as key factors fueling a rebound. GTA V, the predecessor to GTA VI, is one of the most profitable games ever and has sold over 210 million by December 2024. Analysts believe new releases will encourage players to spend more on consoles and games. This could potentially reverse the industry’s recent slowdown.\n\nAccording to the report by Newzoo, console software revenue is projected to increase 7% from 2024 to 2027 and outperform PC software revenue growth of 2.6%. By 2027, console revenue is expected to account for over 56% of the total PC and console software revenue of $92.7 billion. Total playtime increased by 6% in 2024 and Q4 saw the highest quarterly playtime thanks to blockbuster releases like the new Call of Duty title.\n\nEmmanuel Rosier, director of market analysis at Newzoo, told Reuters that major console titles, such as Spider-Man and God of War, are driving engagement on consoles. He also pointed out that these AAA or AAAA releases have less impact on PC gamers, who prefer older titles.\n\nMethodology\n\nTo compile our list of the 10 best gaming stocks to invest in according to billionaires, we looked for the largest gaming companies. We reviewed our own rankings, financial media reports, ETFs, and various online resources to compile a list of the best gaming stocks. Next, we focused on the top 10 gaming stocks most favored by billionaires. Data for the number of billionaire investors for each stock was taken from Insider Monkey’s Q4 2024 database. Finally, the 10 best gaming stocks to invest in were ranked in ascending order based on the number of billionaires holding stakes in them as of Q4 2024.", "language": "en", "sentiment": "positive", "confidence": "0.9991558790206909", "stock_name": "Microsoft"}, {"link": "https://finance.yahoo.com/news/2-artificial-intelligence-stocks-buy-221800286.html", "source": "finance.yahoo.com", "title": "2 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade", "summary": "", "publishDate": "2025-03-29T22:18:00.000Z", "content": "In addition, Alphabet is leading the way in autonomous driving and robotaxis with its Waymo unit. It is currently the only company offering paid rides in the U.S. and has been expanding to new cities. It has also begun to take share in more established markets like San Francisco as customers become more comfortable with the technology. While Alphabet needs to drive down the prices of its technology, it is clearly the leader in this emerging space.\n\nAI Overviews should eventually lead to new monetization opportunities. Historically, Google has only displayed ads on about 20% of its searches, with cost-per-click being a big source of its ad revenue. However, it uses other ad formats through its AdSense platform, such as display, text, and video ads, and could use these types of ads to generate revenue for its AI Overviews. It also operates the Gemini generative AI chatbot. While still behind some competitors, the chatbot is starting to improve and catch up. The company is also ahead in some AI areas, such as text-to-video, where its Veo 2 platform has demonstrated strong results, given its training on YouTube videos.\n\nMeanwhile, Alphabet is leaning heavily into AI. The company owns the world's third largest cloud-computing platform where it helps customers develop their own specialized AI models and applications through its Vertex AI platform. The platform enables customers to use Gemini or other foundational models as a starting point. Alphabet is also using Gemini to help improve its search results and power its AI Overviews.\n\nIn addition, Alphabet owns YouTube, the most watched streaming service. As a stand-alone entity, YouTube is the fourth largest digital advertising platform in the world. The company's model of sharing advertising revenue with its creators reduces heavy upfront content spending and leads to strong profitability.\n\nWhile known for its Google search engine, Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) has a strong collection of businesses. Google is still its prized possession and for good reason. It holds about a 90% global market share for search and is the world's largest digital advertising platform. While there are a number of AI-powered competitors looking to make inroads, none have the scale of users or network of advertisers that Google has.\n\nLet's look at two AI stocks that investors can buy and hold for the next decade.\n\nFollowing the recent market pullback, a number of high-quality tech stocks based in artificial intelligence (AI) are now trading at more attractive prices. This is a great opportunity to purchase shares of these market-leading companies.\n\nStory Continues\n\nEven further out, Alphabet is a leader in quantum computing with its Willow chip. Last year, the company made a major breakthrough in the space. One of the big issues with quantum computing is that it is error prone especially as it scales, but Willow has begun reducing errors as it scales. Quantum computing is still far from commercial applications, but this once again demonstrates how Alphabet is a technology-leading enterprise. The ability to innovate and adapt is the key for turning a tech company into a good, long-term investment.\n\nImage source: Getty Images.\n\n2. Microsoft\n\nLike Alphabet, Microsoft (NASDAQ: MSFT) has a collection of market-leading businesses with strong AI ties. The company was one of the first big tech companies to embrace AI when it made a large investment in OpenAI, the maker of ChatGPT, and partnered with the start-up.\n\nMicrosoft's use of OpenAI's AI models has helped drive its own cloud business, Azure. The platform provides customers with the infrastructure to train their own AI models while offering AI-powered analytics, security, and management tools. Though the business has been capacity-constrained, Microsoft is spending heavily building out data centers to keep up with demand.\n\nMeanwhile, the company has incorporated AI assistant copilots throughout its offerings. The biggest push has been with the copilots for its Microsoft 365 subscription service, which includes access to its popular work productivity tools, such as Word, Excel, and PowerPoint. The company is advancing how its copilots can help workers become more productive. A cost of $30 per month per enterprise user presents a big opportunity for the company moving forward. The company also recently added new security AI copilot agents, extending its market for AI copilots.\n\nWhile Microsoft has relied on OpenAI, it isn't standing still. It has been reported that the company is developing its own in-house AI reasoning models, as well as starting to work with other third-party models. This will help reduce its dependence on OpenAI and allow it to use its own AI models to help power its copilots going forward.\n\nCurrently, Microsoft and OpenAI's partnership agreement runs through 2030, and the two companies remain close. However, the software giant is clearly looking ahead; having its own internal AI model options certainly gives it future leverage.\n\nMicrosoft has also developed its first video game AI model called Muse. It will look for the AI model to help speed up new game development, as well as possibly preserve classic games that can be used on modern hardware. Gaming is a big business for Microsoft through its Xbox hardware and gaming studios, including Activision Blizzard. It will be exciting to see how it will incorporate AI into its games and make them better.\n\nWhile Microsoft continues to see solid growth through the help of its AI offerings, the possibilities of what comes next are what makes the stock attractive. The company has been very adaptive over the years, transitioning to a subscription-as-a-service model for its productivity software and then later as one of the first big tech companies to embrace AI.\n\nIt is this ability to plan ahead and adapt that makes Microsoft a stock to buy and hold for a long time.\n\nShould you invest $1,000 in Alphabet right now?\n\nBefore you buy stock in Alphabet, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Alphabet wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $672,177!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 815% — a market-crushing outperformance compared to 162% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of March 24, 2025\n\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Geoffrey Seiler has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n\n2 Artificial Intelligence Stocks You Can Buy and Hold for the Next Decade was originally published by The Motley Fool", "language": "en", "sentiment": "positive", "confidence": "0.7049543261528015", "stock_name": "Microsoft"}, {"link": "https://finance.yahoo.com/news/2-magnificent-seven-ai-stocks-200000682.html", "source": "finance.yahoo.com", "title": "2 \"Magnificent Seven\" AI Stocks to Buy on the Dip", "summary": "", "publishDate": "2025-03-29T20:00:00.000Z", "content": "Artificial intelligence (AI) might be the best investment opportunity in years, perhaps in decades. According to Amazon CEO Andy Jassy, \"Generative AI may be the largest technology transformation since the cloud (which itself, is still in the early stages), and perhaps since the internet.\"\n\nWall Street has taken notice: Many AI, or AI-adjacent companies, have been on fire for the past two years, but they recently collectively took a bit of a dive due to industry-specific issues. Earlier this year, a China-based company called DeepSeek developed an AI chatbot with far less money and resources than some of the leaders in the field, which rocked the industry. Market wide headwinds have also played a key role in the recent dip. President Trump's trade wars could impact businesses across various sectors and harm economic activity.\n\nThough these headwinds are genuine, the recent drop represents a good opportunity to purchase shares of top AI stocks on a slight dip, at least for those with excellent prospects. That's the case with Apple (NASDAQ: AAPL) and Microsoft (NASDAQ: MSFT). These two are part of the so-called \"Magnificent Seven\" and are still excellent buy-and-hold options even with market caps near $3 trillion.\n\n1. Apple\n\nApple was a latecomer in AI. The tech company announced it would add a suite of AI features -- dubbed Apple Intelligence -- to some of its latest devices and operating systems. By the time it did, some companies were already earning meaningful revenue from their AI-related work. Further, Apple's grand entrance into the field didn't impress many investors and analysts. We are still waiting to see whether and to what extent it will lead to a renewal cycle for the company's iPhone and other gadgets. However, Apple often takes its time releasing tweaked versions of existing technologies -- the result is usually a hit.\n\nThe iPhone wasn't the first smartphone, nor were AirPods or the Apple Watch the first of their kind -- but all of these products became incredibly popular. Apple has several strengths that could allow it to make noise in AI. First, it boasts a massive ecosystem of 2.35 billion active devices that's just begging to be monetized in umpteen different ways. Second, and relatedly, Apple has one of the strongest brand names in the world.\n\nEven if some of its AI-related initiatives aren't original, they could still attract significant attention because of the company's brand. Beyond AI, Apple will use its strengths to pursue many growth paths. It now supports more than a billion paid subscriptions within its services segment. Some of these are in industries with excellent long-term prospects, such as fintech. And as Apple's high-margin services unit grows in prominence, it will work wonders for its bottom line.", "language": "en", "sentiment": "positive", "confidence": "0.6454977989196777", "stock_name": "Apple"}, {"link": "https://finance.yahoo.com/news/apple-inc-aapl-mega-cap-195823989.html", "source": "finance.yahoo.com", "title": "Is Apple Inc. (AAPL) The Mega Cap Stock Gaining Bullish Momentum This Week?", "summary": "", "publishDate": "2025-03-29T19:58:23.000Z", "content": "We recently published a list of 10 Mega Cap Stocks Gaining Bullish Momentum This Week. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other mega cap stocks gaining bullish momentum this week.\n\nThe S&P 500 index started the week with a bang after staying under pressure for a few days. There was a realization that Wall Street may have overestimated the impact of tariffs. Once the dust settles, the market will continue to go higher, just like the US economy which continues to grow despite challenges.\n\nWhen the broader market corrects itself due to uncertainty, such as the one brought about by Trump’s tariff wars, mega-cap stocks also get affected. This provides investors, especially the ones that invest at regular intervals, to take another bite of these impressive stocks. The same situation happened during the last week, and we believe that after Monday’s impressive recovery, the trend is about to reverse.\n\nMega cap stocks like the ones in our list have driven the market in recent months and are therefore likely to be the ones leading it again. We decided to come up with the top 10 mega-cap stocks in the S&P index that have lost a considerable chunk of value in the last month and are now trading at a discount, a valuation gap that could quickly be recovered during this week’s trading.\n\nTo come up with the list of 10 oversold S&P 500 Mega-Cap Stocks To Trade This Week, we only looked at stocks with a market cap of at least $200 billion that have lost the most value in the last month.\n\nIs Apple Inc. (AAPL) The Mega Cap Stock Gaining Bullish Momentum This Week?\n\nA wide view of an Apple store, showing the range of products the company offers.\n\nApple Inc. (NASDAQ:AAPL)\n\nApple Inc. (NASDAQ:AAPL) operates as a manufacturer, designer, and marketer of personal computers, wearables, smartphones, tablets, and accessories. The company provides iPhone, iPad, Mac, and wearables. It also offers AppleCare support and cloud services.\n\nLike any other good company, Apple stock continues to trade at a ridiculous valuation despite a 10% downturn in price within a month. According to a recent report published by Morgan Stanley, Apple is among a handful of stocks that are ideally placed to sustain an economic downturn. However, the fact that it is also expensive makes it a tough decision for long-term investors.\n\nThere are quite a few things that should soothe investors when talks of a bubble come around. A major difference between the current high valuations and the ones during the dot-com bubble is that valuations then were based on non-financial metrics like viewers and clicks. Today’s valuations are much more solid as they are based on the actual earnings of the companies.", "language": "en", "sentiment": "positive", "confidence": "0.9999998807907104", "stock_name": "Apple"}, {"link": "https://www.reuters.com/technology/artificial-intelligence/openai-must-complete-for-profit-transition-by-year-end-raise-full-40-billion-2025-03-28/", "source": "www.reuters.com", "title": "OpenAI must complete for-profit transition by year-end to raise full $40 billion", "summary": "OpenAI must transition to a for-profit company by the end of the year to secure the full $40 billion funding led by SoftBank it is in the final stages of raising, a person familiar with the matter said on Friday.", "publishDate": "2025-03-28T21:39:06.057Z", "content": "OpenAI must transition to a for-profit company by the end of the year to secure the full $40 billion funding led by SoftBank it is in the final stages of raising, a person familiar with the matter said on Friday.\nSoftBank <a href=\"https://www.reuters.com/markets/companies/9984.T\" target=\"_blank\">(9984.T)</a> can pare back the size of the funding round to $20 billion if Microsoft-backed <a href=\"https://www.reuters.com/markets/companies/MSFT.O\" target=\"_blank\">(MSFT.O)</a> OpenAI fails to restructure into a for-profit company by the end of the year.\nThe Wall Street Journal was the first to report the news earlier in the day.\nThis would mark an accelerated deadline for OpenAI to pull off its complicated transition. It was under a two-year deadline from its last round of financing with investors.\nThe startup has said its transition to a for-profit entity is required to secure the capital it needs to develop the best AI models.\nOpenAI did not immediately respond to a Reuters request for comment.", "language": "en", "sentiment": "neutral", "confidence": "0.9981822967529297", "stock_name": "Microsoft"}]}, "AMZN,SPY,U11.SI_30_5_en": {"timestamp": 1743314328.958737, "data": [{"link": "https://www.wsj.com/tech/the-drone-delivery-service-beating-amazon-to-your-front-door-1ad898b4", "source": "www.wsj.com", "title": "The Drone-Delivery Service Beating Amazon to Your Front Door", "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables.", "publishDate": "2025-03-29T00:00:00.000Z", "content": "", "language": "en", "sentiment": "neutral", "confidence": "0.9999489784240723", "stock_name": "Amazon"}, {"link": "https://www.reuters.com/technology/artificial-intelligence/scale-ai-seeking-valuation-high-25-billion-potential-tender-offer-business-2025-03-28/", "source": "www.reuters.com", "title": "Scale AI seeking valuation as high as $25 billion in potential tender offer, Business Insider reports", "summary": "Artificial intelligence startup Scale AI is seeking a valuation as high as $25 billion in a potential tender offer as it looks to capitalize on the booming demand for the technology, Business Insider reported on Friday, citing multiple sources.", "publishDate": "2025-03-28T21:53:28.475Z", "content": "Artificial intelligence startup Scale AI is seeking a valuation as high as $25 billion in a potential tender offer as it looks to capitalize on the booming demand for the technology, Business Insider reported on Friday, citing multiple sources.\nTop tech companies are racing to build AI into their products and services. Startups catering to the surge in demand for AI chips and machine learning have been a bright spot in the private funding market.\nTerms of California-based Scale AI's tender offer, where investors and/or the company buy shares from existing shareholders, are being discussed and the final valuation could change, the report said.\nThe startup, which was valued at nearly <a href=\"/technology/ai-startup-scale-ai-raises-1-billion-fresh-funding-2024-05-21/\">$14 billion</a> in a funding round last year, did not immediately respond to Reuters' request for comment on the report.\nFounded in 2016, Scale AI is backed by tech giants Nvidia <a href=\"https://www.reuters.com/markets/companies/NVDA.O\" target=\"_blank\">(NVDA.O)</a>, Amazon <a href=\"https://www.reuters.com/markets/companies/AMZN.O\" target=\"_blank\">(AMZN.O)</a> and Meta <a href=\"https://www.reuters.com/markets/companies/META.O\" target=\"_blank\">(META.O)</a>.\nThe company provides vast amounts of accurately labeled data, which is pivotal for training sophisticated tools like OpenAI's ChatGPT.\nThe U.S. Department of Labor is <a href=\"/technology/us-labor-department-investigating-nvidia-amazon-backed-startup-scale-ai-2025-03-06/\">investigating</a> Scale AI for its compliance with the Fair Labor Standards Act.", "language": "en", "sentiment": "neutral", "confidence": "0.7845639586448669", "stock_name": "Amazon"}, {"link": "https://finance.yahoo.com/news/inflation-fears-spark-risk-off-175314375.html", "source": "finance.yahoo.com", "title": "Inflation Fears Spark Risk-Off Sentiment As Magnificent 7 Drop: What's Driving Markets Friday?", "summary": "", "publishDate": "2025-03-28T17:53:14.000Z", "content": "Markets faltered on Friday, with Wall Street reeling as investors hurried to shed risk in the face of mounting inflation and tariff uncertainties.\n\nThe S&P 500 fell 2.1% by 1:30 p.m. trading in New York, on track to end the week with losses. The tech-heavy Nasdaq 100 tumbled 2.6%, and the Dow fell 1.7%.\n\nAll members of the Magnificent Seven group were in the red, with Amazon.com Inc. (NASDAQ:AMZN) and Alphabet Inc. (NASDAQ:GOOGL) marking the widest drops, both down 4.4%.\n\nEarlier on Friday, the Fed's favorite inflation gauge – the core Personal Consumption Expenditure price index – rose 2.8% on a yearly basis in February, surprising estimates of 2.7%.\n\nInvestor anxiety deepened following the latest University of Michigan Survey of Consumers, which showed 5-year forward inflation expectations jumping to 4.1% — a 0.2-point increase from prior estimates and the highest reading since February 1993. As stocks fell in unison, a flight to safety ensued, sending gold up 1% to a record-breaking $3,090 per ounce. Treasury bonds also rallied, with yields declining across all maturities.\n\nPrice action in commodities was mixed with oil down 1% and natural gas up 2.4%. Sentiment in crypto also took a sharp hit, with Bitcoin (CRYPTO: BTC) down by 4% to below $84,000, flipping to weekly losses.\n\nFriday's Performance In Major US Indices, ETFs\n\n\n\n\n\nMajor Indices Price Chg % Dow Jones 41,597.02 -1.7% S&P 500 5,574.84 -2.1% Russell 2000 2,016.62 -2.3% Nasdaq 100 19,283.98 -2.6%\n\nUpdated at 1:20 p.m. ET\n\nAccording to Benzinga Pro data:\n\nThe SPDR S&P 500 ETF Trust (NYSE:SPY) fell 2.1% to $555.41.\n\nThe SPDR Dow Jones Industrial Average (NYSE:DIA) eased 1.8% to $415.31.\n\nThe tech-heavy Invesco QQQ Trust Series (NASDAQ:QQQ) dropped 2.7% to $468.61.\n\nThe iShares Russell 2000 ETF (NYSE:IWM) fell 2.5% to $199.57\n\nThe Utilities Select Sector SPDR Fund (NYSE:XLU) outperformed, up 0.9%; the Consumer Discretionary Select Sector SPDR Fund (NYSE:XLY) lagged, down 3.2%.\n\nFriday’s Stock Movers", "language": "en", "sentiment": "negative", "confidence": "0.9899840354919434", "stock_name": "SPDR S&P 500 ETF Trust"}, {"link": "https://finance.yahoo.com/news/dad-mini-portfolio-1m-investment-123020359.html", "source": "finance.yahoo.com", "title": "Dad With 'Mini Portfolio' And $1M Investment Plan Wants Son 'Living Off Of Dividend Income Comfortably' – Reddit Debates Best Stocks To Buy", "summary": "", "publishDate": "2025-03-28T12:30:20.000Z", "content": "Every parent wants to give their child a head start in life, especially if they grew up without financial security themselves.\n\nThe desire to break such a generational curse is powerful, but so is the fear of making the wrong move, since a bad investment could derail years of careful planning. This is exactly what a Reddit user is faced with now.\n\nThe investor, a dad of a 2-year-old, has asked for advice on building a $1 million portfolio for his son with the goal of having him live comfortably off dividend income by age 34. The poster is determined to set his son up for financial freedom, so he’s already started a “mini portfolio” with a combo of dividend-oriented ETFs and speculative stocks: Schwab U.S. Dividend Equity ETF (NYSE:SCHD), Astra Space (NASDAQ:ASTR), Virgin Galactic Holdings (NYSE:SPCE), and Vornado Realty Trust (NYSE:VNO).\n\nDon't Miss:\n\nAre you rich? Here’s what Americans think you need to be considered wealthy.\n\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with just $100.\n\n“We are looking for blueprints or instructions on proper investing for our children. How to create wealth is more important than wealth itself. We really would like to make sure he is financially responsible beforehand,” the dad wrote.\n\nHis concerns involve picking the right investments to balance growth and dividends in the next 30-plus years, avoiding costly mistakes, and ensuring his son is financially responsible. The responses to the investor’s post were a mix of encouragement and caution, with many Redditors coming up with suggestions of assets.\n\nTrending: The secret weapon in billionaire investor portfolios that you almost certainly don't own yet. See which asset class has outpaced the S&P 500 (1995-2024) – and with near-zero correlation.\n\n$1 Million Portfolio for a 2-Year-Old–Reddit Advises Dad on Allocations\n\nETFs are Safe for the Long Run\n\nMany commenters suggested individual stocks are too risky for a 30-year investment horizon, and recommended low-cost ETFs instead.\n\n“Not an expert at all, but I’m thinking safe ETFs with high quality companies. Time will take care of everything. Thinking simple: SCHD, [SPDR S&P 500 ETF Trust (NYSE: SPY)],” a comment reads.\n\nA Redditor suggested a mix between dividend-focused and tech assets, which provide both growth and regular payments.\n\n“[Vanguard High Dividend Yield ETF (NYSE: VYM)], [Vanguard Dividend Appreciation ETF (NYSE: VIG)], [Invesco QQQ Trust (NASDAQ: QQQ)]. This is dividend + tech. That’s what I would bet on for 30 years. Dividend low-fee ETF + some growth inform of tech. I personally would pick stocks for the QQQ portion of the fund [(Apple (NASDAQ: AAPL)] + [Microsoft Corporation (NASDAQ: MSFT)] + [Alphabet (NASDAQ: GOOGL, GOOG)] + [Amazon (NASDAQ: AMZN)]).”", "language": "en", "sentiment": "positive", "confidence": "0.9001480937004089", "stock_name": "SPDR S&P 500 ETF Trust"}, {"link": "https://seekingalpha.com/news/4426346-amazon-mgm-studio-head-salke-steps-down-signs-production-deal", "source": "seekingalpha.com", "title": "Amazon MGM Studio head Salke steps down; signs production deal (AMZN:NASDAQ)", "summary": "", "publishDate": "2025-03-28T12:26:28.000Z", "content": "Jennifer Salke, the head of Amazon (NASDAQ:AMZN) MGM Studios, has stepped down from the company and signed a production deal with the studio.\n\n“As I’ve been considering my next chapter, I’ve always been searching for that moment where I was positive", "language": "en", "sentiment": "negative", "confidence": "0.9914076924324036", "stock_name": "Amazon"}]}, "AMZN,BAC,SPY,U11.SI,bitcoin_30_5_en": {"timestamp": 1743314369.516694, "data": [{"link": "https://finance.yahoo.com/news/bitcoin-miner-mara-starts-massive-170204032.html", "source": "finance.yahoo.com", "title": "Bitcoin Miner MARA Starts Massive $2B Stock Sale Plan to Buy More BTC", "summary": "", "publishDate": "2025-03-29T17:02:04.000Z", "content": "Bitcoin mining company MARA Holdings (MARA) is launching a fresh $2 billion stock offering to buy more bitcoin, continuing its plan of buying BTC in the open market through capital raise while sticking to its \"Hodl\" strategy.\n\nAccording to a Form 8-K and a new prospectus filed with the U.S. Securities and Exchange Commission (SEC), MARA entered into an at-the-market (ATM) equity program with a group of investment banks including Barclays, BMO Capital Markets, BTIG, Cantor Fitzgerald, and others. The proceeds of the offering, which will see brokers selling shares of the miner from time to time, will be used mainly for the acquisition of bitcoin in the open market.\n\n\"We currently intend to use the net proceeds from this offering for general corporate purposes, including the acquisition of bitcoin and for working capital,\" MARA said in its prospectus.\n\nThis new fresh stock sales plan follows a previous ATM offering that targeted up to $1.5 billion for the miner.\n\nMARA has adopted Michael Saylor's strategy of raising funds through equity and convertible bond offerings and buying bitcoin in the open market. The miner now holds 46,376 BTC in its treasury, making it the second-largest bitcoin stash among publicly traded companies, behind Strategy’s 506,137 BTC.\n\nThe plan to buy bitcoin in the open market was adopted by the miner last year, even though a miner can theoretically mine bitcoin at a discount to the spot price. The industry became challenging after last year's halving cut mining rewards by half, squeezing profit margins on the back of rising costs. This made buying bitcoin in the open market, alongside mining, a relatively better strategy for the miners. Read more: Bitcoin Mining Is So Rough a Miner Adopted Michael Saylor's Successful BTC Strategy", "language": "en", "sentiment": "neutral", "confidence": "0.9874218702316284", "stock_name": "Bitcoin"}, {"link": "https://www.yahoo.com/news/mike-johnson-net-worth-2025-131500684.html", "source": "www.yahoo.com", "title": "Mike Johnson’s Net Worth in 2025 and Why the Speaker of the House Is Essentially Living Paycheck to Paycheck", "summary": "", "publishDate": "2025-03-29T13:15:00.000Z", "content": "When Mike Johnson was elected Speaker of the House in 2023, his financial disclosures raised eyebrows. It would appear the Republican Congressman from Louisiana, a right-wing evangelical Christian, did not report a bank account or assets going back to 2016. How could that be?\n\n“I'm a man of modest means,” Johnson told Fox News on Sunday, explaining that he’s spent most of his career working in the nonprofit sector and now has multiple kids to put through college. “But I can relate to everybody else,” he said, adding that he’s a “better leader” as a result.\n\n🎬 SIGN UP for Parade's Daily newsletter to get the latest pop culture news & celebrity interviews delivered right to your inbox 🎬\n\nKeep reading for a deep dive into Johnson’s net worth, how the ultra-conservative lawyer got his start in politics, and why he’s basically living paycheck to paycheck.\n\nHow did Speaker Mike Johnson get his start?\n\nJohnson was born Jan. 30, 1972, in Shreveport, Louisiana, to teenage parents (he wound up being the oldest of four). When he was 12, his father, a firefighter, suffered burns over 80 percent of his body in a 1984 explosion. “I saw an actual miracle of my father surviving when they said that he shouldn’t,” he once said. “It made me a person of very deep faith.”\n\nAdvertisement Advertisement\n\nAdvertisement\n\nAfter high school, Johnson got an undergraduate degree in Business Administration from Louisiana State University, where he later attended law school, graduating with his juris doctorate in 1998.\n\nLike many politicians, Johnson worked as a lawyer before entering the D.C. arena. His focus was on constitutional law, religious liberty and family law, and his views were ultra-conservative. Working for the Alliance Defending Freedom, a right-wing advocacy group, he defended Louisiana’s ban on same-sex marriage to the state’s supreme court twice.\n\n“Some people are called to pastoral ministry,” he said, when he first ran for Congress (via The New Yorker). “I was called to legal ministry, and I’ve been out on the front lines of the ‘culture war.’”\n\nIn 2015, Johnson was elected to the Louisiana House of Representatives, where he continued to advocate for conservative causes, and the following year, he was voted into the U.S. House of Representatives, representing Louisiana's 4th congressional district.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nJohnson was chosen as Speaker of the House in October 2023 after the ousting of Speaker Kevin McCarthy.\n\nRelated: Get to Know Melania Trump\n\nWhat are Speaker Mike Johnson’s political views?\n\nJohnson is a conservative Christian and the most right-wing speaker in recent history. Same-sex marriage? He’s opposed to it. Abortion? He wants a national ban on it. (He once said that Roe v. Wade “gave constitutional cover to the elective killing of unborn children in America, period.”)\n\nIn 2022, he introduced legislation that came to be known as the “don’t say gay” bill, as it would prohibit any talk of sexual orientation and gender identity at any federally-funded institution.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nHe also curried favor with MAGA Republicans in 2020 by refusing to certify the election.\n\nRelated: Find Out Elon Musk’s Net Worth\n\nWhat is Speaker Mike Johnson’s net worth?\n\nForbes estimates that Mike Johnson’s net worth is in the ballpark of $350,000, making him the least wealthy speaker of the century (along with being the least experienced). For comparison, Johnson’s predecessor Kevin McCarthy owned an investment portfolio in the six figures and former speaker Paul Ryan had assets in the millions. On the left, Nancy Pelosi’s net worth has been pegged at nearly $250 million, eclipsing them all.\n\nAccording to Forbes, Johnson’s main asset—as listed in his financial disclosure forms—is his Benton, Louisiana home, worth an estimated $600,000 (he and his wife, Kelly, borrowed $290,000 to buy the home for $428,500 in 2013), He didn’t even list a checking account or retirement account. (That doesn’t mean he doesn’t have a checking account, FYI; it just means that any such account doesn’t bear interest and isn’t, therefore, subject to disclosure.)\n\nWhat is Speaker Mike Johnson’s salary in Congress?\n\nJohnson’s congressional salary is $174,000.\n\nRelated: From Peanut Farmer to President: Find Out Jimmy Carter’s Net Worth at the Time of His Death\n\nWhat does Mike Johnson get paid to be Speaker of the House?\n\nJohnson got a roughly $50,000 raise to be Speaker of the House, earning $223,000 per year.\n\nHow does Speaker Johnson make his money?\n\nJohnson has made his money as a lawyer and a politician, and despite his modest net worth, he’s earned a good salary doing both. For instance, in 2015, he took a job as a partner at a Louisiana law firm, making $128,000 that year and $181,000 the following. He also earned $35,000 during that period for his seat in the Louisiana state House, a part-time gig.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nOnce he was elected to Congress, he started earning $174,000 a year. Then he got a $50,000 raise to be Speaker of the House.\n\nMeantime, starting in 2018, Johnson began teaching college courses online at the Christian Liberty University, raking in up to $30,000 a year, according to Forbes.\n\nOverall, his income has left many people scratching their heads over why the speaker appears to be living paycheck to paycheck. He’s chalked it up to having a lot of expenses, including several kids in college or graduate school.\n\nRelated: Donald Trump’s Net Worth in 2025 and How Much He Still Owes in Civil Suits", "language": "en", "sentiment": "neutral", "confidence": "0.9999470710754395", "stock_name": "Bank of America"}, {"link": "https://www.wsj.com/tech/the-drone-delivery-service-beating-amazon-to-your-front-door-1ad898b4", "source": "www.wsj.com", "title": "The Drone-Delivery Service Beating Amazon to Your Front Door", "summary": "Soon your burrito bowl could arrive via the sky. Zipline’s drones make deliveries by lowering small coolers on 300-foot cables.", "publishDate": "2025-03-29T00:00:00.000Z", "content": "", "language": "en", "sentiment": "neutral", "confidence": "0.9999489784240723", "stock_name": "Amazon"}, {"link": "https://finance.yahoo.com/video/bitcoin-season-2-gamestop-pulls-223426459.html", "source": "finance.yahoo.com", "title": "BITCOIN SEASON 2: Gamestop pulls a Microstrategy", "summary": "", "publishDate": "2025-03-28T22:34:26.000Z", "content": "There are no important events for this country at this time. Select \"All\" to see top events in other countries or view all events.", "language": "en", "sentiment": "neutral", "confidence": "0.9998897314071655", "stock_name": "Bitcoin"}, {"link": "https://www.reuters.com/technology/artificial-intelligence/scale-ai-seeking-valuation-high-25-billion-potential-tender-offer-business-2025-03-28/", "source": "www.reuters.com", "title": "Scale AI seeking valuation as high as $25 billion in potential tender offer, Business Insider reports", "summary": "Artificial intelligence startup Scale AI is seeking a valuation as high as $25 billion in a potential tender offer as it looks to capitalize on the booming demand for the technology, Business Insider reported on Friday, citing multiple sources.", "publishDate": "2025-03-28T21:53:28.475Z", "content": "Artificial intelligence startup Scale AI is seeking a valuation as high as $25 billion in a potential tender offer as it looks to capitalize on the booming demand for the technology, Business Insider reported on Friday, citing multiple sources.\nTop tech companies are racing to build AI into their products and services. Startups catering to the surge in demand for AI chips and machine learning have been a bright spot in the private funding market.\nTerms of California-based Scale AI's tender offer, where investors and/or the company buy shares from existing shareholders, are being discussed and the final valuation could change, the report said.\nThe startup, which was valued at nearly <a href=\"/technology/ai-startup-scale-ai-raises-1-billion-fresh-funding-2024-05-21/\">$14 billion</a> in a funding round last year, did not immediately respond to Reuters' request for comment on the report.\nFounded in 2016, Scale AI is backed by tech giants Nvidia <a href=\"https://www.reuters.com/markets/companies/NVDA.O\" target=\"_blank\">(NVDA.O)</a>, Amazon <a href=\"https://www.reuters.com/markets/companies/AMZN.O\" target=\"_blank\">(AMZN.O)</a> and Meta <a href=\"https://www.reuters.com/markets/companies/META.O\" target=\"_blank\">(META.O)</a>.\nThe company provides vast amounts of accurately labeled data, which is pivotal for training sophisticated tools like OpenAI's ChatGPT.\nThe U.S. Department of Labor is <a href=\"/technology/us-labor-department-investigating-nvidia-amazon-backed-startup-scale-ai-2025-03-06/\">investigating</a> Scale AI for its compliance with the Fair Labor Standards Act.", "language": "en", "sentiment": "neutral", "confidence": "0.7845639586448669", "stock_name": "Amazon"}]}}